<template lang="html">
    <Page actionBarHidden="true">
        <StackLayout>
            <StackLayout orientation="horizontal" width="100%" height="64.05" borderBottomWidth="1.05" borderBottomColor="#dddddd">
                <StackLayout width="8%" marginLeft="2%" marginTop="17.5" @tap="$navigateBack">
                    <FIcon name="fa-angle-left" color="#555555"  fontSize="30%"/>
                </StackLayout>
                <StackLayout marginTop="40%" marginLeft="27%">
                    <label text="개인정보 처리방침"  style="font-family: nanumsquareroundeb" fontSize="15%" color="#333333" />
                </StackLayout>
            </StackLayout>
            <StackLayout>
                <StackLayout orientation="horizontal">
                    <StackLayout marginTop="23.45" marginLeft="17.5">
                        <label text="개인정보 처리방침" fontSize="16.45" color="#333333"  style="font-family: nanumsquareroundeb"  />
                    </StackLayout>
                    <!--                <StackLayout marginTop="24.5" marginLeft="113.05">-->
                    <!--                    <label text="시행일자" color="#333333" fontSize="14" style="font-family: nanumsquareroundr"/>-->
                    <!--                </StackLayout>-->
                    <!--                <StackLayout width="114.55" marginTop="18.68" marginLeft="24.5" borderWidth="1" borderRadius="3.5" borderColor="#888888">-->
                    <!--                    &lt;!&ndash;Dropdown List widget&ndash;&gt;-->
                    <!--                    <DropDown #dd-->
                    <!--                              col="1" id="ddlColors"-->
                    <!--                              itemsRowHeight="30"-->
                    <!--                              :items="listPickerDate" selectedIndex="0" color="#888888" marginLeft="9.45" >-->
                    <!--                    </DropDown>-->
                    <!--                </StackLayout>-->
                </StackLayout>
                <StackLayout marginTop="15.05" marginLeft="17.5" color="#333333">
                    <StackLayout>
                        <label :text="policy.title" style="font-family: nanumsquareroundeb" fontSize="12.95" />
                        <TextView :text="policy.contents" style="font-family: nanumsquareroundr" backgroundColor="#ffffff" color="#333333" lineHeight="23.45" fontSize="12.95" width="100%"  editable="false"/>
                    </StackLayout>
                </StackLayout>
            </StackLayout>
        </StackLayout>
    </Page>
</template>
<script>
    import { SelectedIndexChangedEventData } from "nativescript-drop-down";

    export default {
        name:"Terms",
        components: {
        },data(){
            return {
                listPickerDate: ["2020.01.03", "2019.12.12", "2018.12.18"
                ],
                selectedListPickerIndex: 0,
                policy:
                    {
                        "title": "개인정보 처리방침",
                        "contents":
                            "잇정('www.eatjeung.com'이하 '잇정')은(는) 개인정보보호법에 따라 이용자의 개인정보 보호 및 권익을 보호하고 개인정보와 관련한 이용자의 고충을 원활하게 처리할 수 있도록 다음과 같은 처리방침을 두고 있습니다.\n" +
                            "\n" +
                            "잇정 은(는) 회사는 개인정보처리방침을 개정하는 경우 웹사이트 공지사항(또는 개별공지)을 통하여 공지할 것입니다.\n" +
                            "\n" +
                            "○ 본 방침은부터 2020년 2월 27일부터 시행됩니다.\n" +
                            "\n" +
                            "\n" +
                            "1. 개인정보의 처리 목적 잇정('www.eatjeung.com'이하 '잇정')은(는) 개인정보를 다음의 목적을 위해 처리합니다. 처리한 개인정보는 다음의 목적이외의 용도로는 사용되지 않으며 이용 목적이 변경될 시에는 사전동의를 구할 예정입니다.\n" +
                            "\n" +
                            "가. 홈페이지 회원가입 및 관리\n" +
                            "\n" +
                            "회원 가입의사 확인, 회원제 서비스 제공에 따른 본인 식별·인증, 회원자격 유지·관리, 서비스 부정이용 방지, 각종 고지·통지, 고충처리, 분쟁 조정을 위한 기록 보존 등을 목적으로 개인정보를 처리합니다.\n" +
                            "\n" +
                            "\n" +
                            "나. 민원사무 처리\n" +
                            "\n" +
                            "민원인의 신원 확인, 민원사항 확인, 사실조사를 위한 연락·통지, 처리결과 통보 등을 목적으로 개인정보를 처리합니다.\n" +
                            "\n" +
                            "\n" +
                            "다. 재화 또는 서비스 제공\n" +
                            "\n" +
                            "서비스 제공, 콘텐츠 제공, 맞춤 서비스 제공, 본인인증 등을 목적으로 개인정보를 처리합니다.\n" +
                            "\n" +
                            "\n" +
                            "라. 마케팅 및 광고에의 활용\n" +
                            "\n" +
                            "신규 서비스(제품) 개발 및 맞춤 서비스 제공, 이벤트 및 광고성 정보 제공 및 참여기회 제공 , 서비스의 유효성 확인, 접속빈도 파악 또는 회원의 서비스 이용에 대한 통계 등을 목적으로 개인정보를 처리합니다.\n" +
                            "\n" +
                            "\n" +
                            "\n" +
                            "\n" +
                            "2. 개인정보 파일 현황\n" +
                            "('www.eatjeung.com'이하 '잇정')가 개인정보 보호법 제32조에 따라 등록․공개하는 개인정보파일의 처리목적은 다음과 같습니다.\n" +
                            "\n" +
                            "1. 개인정보 파일명 : 개인정보처리방침\n" +
                            "- 개인정보 항목 : 이메일, 휴대전화번호, 비밀번호, 성별, 생년월일, 서비스 이용 기록, 접속 로그, 쿠키\n" +
                            "- 수집방법 : 홈페이지, 모바일앱\n" +
                            "- 보유근거 : 회원가입 시 동의\n" +
                            "- 보유기간 : 지체없이 파기\n" +
                            "- 관련법령 : 정보통신망법\n" +
                            "\n" +
                            "\n" +
                            "\n" +
                            "※ 기타('www.eatjeung.com'이하 '잇정')의 개인정보파일 등록사항 공개는 행정안전부 개인정보보호 종합지원 포털(www.privacy.go.kr) → 개인정보민원 → 개인정보열람등 요구 → 개인정보파일 목록검색 메뉴를 활용해주시기 바랍니다.\n" +
                            "\n" +
                            "3. 개인정보의 처리 및 보유 기간\n" +
                            "\n" +
                            "① 잇정은(는) 법령에 따른 개인정보 보유·이용기간 또는 정보주체로부터 개인정보를 수집시에 동의 받은 개인정보 보유,이용기간 내에서 개인정보를 처리,보유합니다.\n" +
                            "\n" +
                            "② 각각의 개인정보 처리 및 보유 기간은 다음과 같습니다.\n" +
                            "\n" +
                            "1.<홈페이지 회원가입 및 관리>\n" +
                            "<홈페이지 회원가입 및 관리>와 관련한 개인정보는 수집.이용에 관한 동의일로부터<지체없이 파기>까지 위 이용목적을 위하여 보유.이용됩니다.\n" +
                            "-보유근거 : 회원가입 시 동의\n" +
                            "-관련법령 : 정보통신망법\n" +
                            "\n" +
                            "4. 정보주체와 법정대리인의 권리·의무 및 그 행사방법 이용자는 개인정보주체로써 다음과 같은 권리를 행사할 수 있습니다.\n" +
                            "\n" +
                            "① 정보주체는 잇정에 대해 언제든지 개인정보 열람,정정,삭제,처리정지 요구 등의 권리를 행사할 수 있습니다.\n" +
                            "② 제1항에 따른 권리 행사는잇정에 대해 개인정보 보호법 시행령 제41조제1항에 따라 서면, 전자우편, 모사전송(FAX) 등을 통하여 하실 수 있으며 잇정은(는) 이에 대해 지체 없이 조치하겠습니다.\n" +
                            "③ 제1항에 따른 권리 행사는 정보주체의 법정대리인이나 위임을 받은 자 등 대리인을 통하여 하실 수 있습니다. 이 경우 개인정보 보호법 시행규칙 별지 제11호 서식에 따른 위임장을 제출하셔야 합니다.\n" +
                            "④ 개인정보 열람 및 처리정지 요구는 개인정보보호법 제35조 제5항, 제37조 제2항에 의하여 정보주체의 권리가 제한 될 수 있습니다.\n" +
                            "⑤ 개인정보의 정정 및 삭제 요구는 다른 법령에서 그 개인정보가 수집 대상으로 명시되어 있는 경우에는 그 삭제를 요구할 수 없습니다.\n" +
                            "⑥ 잇정은(는) 정보주체 권리에 따른 열람의 요구, 정정·삭제의 요구, 처리정지의 요구 시 열람 등 요구를 한 자가 본인이거나 정당한 대리인인지를 확인합니다.\n" +
                            "\n" +
                            "\n" +
                            "\n" +
                            "5. 처리하는 개인정보의 항목 작성\n" +
                            "\n" +
                            "① 잇정('www.eatjeung.com'이하 '잇정')은(는) 다음의 개인정보 항목을 처리하고 있습니다.\n" +
                            "\n" +
                            "1<홈페이지 회원가입 및 관리>\n" +
                            "- 필수항목 : 이메일, 휴대전화번호, 비밀번호, 생년월일\n" +
                            "- 선택항목 : 성별\n" +
                            "\n" +
                            "\n" +
                            "\n" +
                            "6. 개인정보의 파기잇정은(는) 원칙적으로 개인정보 처리목적이 달성된 경우에는 지체없이 해당 개인정보를 파기합니다. 파기의 절차, 기한 및 방법은 다음과 같습니다.\n" +
                            "\n" +
                            "-파기절차\n" +
                            "이용자가 입력한 정보는 목적 달성 후 별도의 DB에 옮겨져(종이의 경우 별도의 서류) 내부 방침 및 기타 관련 법령에 따라 일정기간 저장된 후 혹은 즉시 파기됩니다. 이 때, DB로 옮겨진 개인정보는 법률에 의한 경우가 아니고서는 다른 목적으로 이용되지 않습니다.\n" +
                            "\n" +
                            "-파기기한\n" +
                            "이용자의 개인정보는 개인정보의 보유기간이 경과된 경우에는 보유기간의 종료일로부터 5일 이내에, 개인정보의 처리 목적 달성, 해당 서비스의 폐지, 사업의 종료 등 그 개인정보가 불필요하게 되었을 때에는 개인정보의 처리가 불필요한 것으로 인정되는 날로부터 5일 이내에 그 개인정보를 파기합니다.\n" +
                            "\n" +
                            "-파기방법\n" +
                            "전자적 파일 형태의 정보는 기록을 재생할 수 없는 기술적 방법을 사용합니다.\n" +
                            "\n" +
                            "\n" +
                            "\n" +
                            "7. 개인정보 자동 수집 장치의 설치•운영 및 거부에 관한 사항\n" +
                            "\n" +
                            "① 잇정 은 개별적인 맞춤서비스를 제공하기 위해 이용정보를 저장하고 수시로 불러오는 ‘쿠기(cookie)’를 사용합니다. ② 쿠키는 웹사이트를 운영하는데 이용되는 서버(http)가 이용자의 컴퓨터 브라우저에게 보내는 소량의 정보이며 이용자들의 PC 컴퓨터내의 하드디스크에 저장되기도 합니다. 가. 쿠키의 사용 목적 : 이용자가 방문한 각 서비스와 웹 사이트들에 대한 방문 및 이용형태, 인기 검색어, 보안접속 여부, 등을 파악하여 이용자에게 최적화된 정보 제공을 위해 사용됩니다. 나. 쿠키의 설치•운영 및 거부 : 웹브라우저 상단의 도구>인터넷 옵션>개인정보 메뉴의 옵션 설정을 통해 쿠키 저장을 거부 할 수 있습니다. 다. 쿠키 저장을 거부할 경우 맞춤형 서비스 이용에 어려움이 발생할 수 있습니다.\n" +
                            "\n" +
                            "8. 개인정보 보호책임자 작성\n" +
                            "\n" +
                            "\n" +
                            "① 잇정(‘www.eatjeung.com’이하 ‘잇정) 은(는) 개인정보 처리에 관한 업무를 총괄해서 책임지고, 개인정보 처리와 관련한 정보주체의 불만처리 및 피해구제 등을 위하여 아래와 같이 개인정보 보호책임자를 지정하고 있습니다.\n" +
                            "\n" +
                            "▶ 개인정보 보호책임자\n" +
                            "성명 :지태관\n" +
                            "직책 :대표\n" +
                            "직급 :대표\n" +
                            "연락처 :01049191128, jeetkn@naver.com\n" +
                            "※ 개인정보 보호 담당부서로 연결됩니다.\n" +
                            "\n" +
                            "정보주체께서는 잇정(‘www.eatjeung.com’이하 ‘잇정) 의 서비스(또는 사업)을 이용하시면서 발생한 모든 개인정보 보호 관련 문의, 불만처리, 피해구제 등에 관한 사항을 개인정보 보호책임자 및 담당부서로 문의하실 수 있습니다. 잇정(‘www.eatjeung.com’이하 ‘잇정) 은(는) 정보주체의 문의에 대해 지체 없이 답변 및 처리해드릴 것입니다.\n" +
                            "\n" +
                            "\n" +
                            "\n" +
                            "9. 개인정보 처리방침 변경\n" +
                            "\n" +
                            "①이 개인정보처리방침은 시행일로부터 적용되며, 법령 및 방침에 따른 변경내용의 추가, 삭제 및 정정이 있는 경우에는 변경사항의 시행 7일 전부터 공지사항을 통하여 고지할 것입니다.\n" +
                            "\n" +
                            "\n" +
                            "\n" +
                            "10. 개인정보의 안전성 확보 조치 잇정은(는) 개인정보보호법 제29조에 따라 다음과 같이 안전성 확보에 필요한 기술적/관리적 및 물리적 조치를 하고 있습니다.\n" +
                            "\n" +
                            "1. 정기적인 자체 감사 실시\n" +
                            "개인정보 취급 관련 안정성 확보를 위해 정기적(분기 1회)으로 자체 감사를 실시하고 있습니다.\n" +
                            "\n" +
                            "2. 개인정보의 암호화\n" +
                            "이용자의 개인정보는 비밀번호는 암호화 되어 저장 및 관리되고 있어, 본인만이 알 수 있으며 중요한 데이터는 파일 및 전송 데이터를 암호화 하거나 파일 잠금 기능을 사용하는 등의 별도 보안기능을 사용하고 있습니다.\n" +
                            "\n" +
                            "3. 문서보안을 위한 잠금장치 사용\n" +
                            "개인정보가 포함된 서류, 보조저장매체 등을 잠금장치가 있는 안전한 장소에 보관하고 있습니다.\n"
                    }
            }
        },methods :{
            onchange() {
                console.log(`Drop Down selected index changed from `);
            }
        }

    };


</script>

<style lang="scss">
    TabView {
        font-family: nanumgothiccoding-bold;
        font-size: 14;
        highlighted-color: lightgrey;
        tab-text-color: #F2F2F2;
        selected-tab-text-color: black;
        android-selected-tab-highlight-color: #848484;
        tab-background-color: lightgray;
    }
</style>
